package HomeWork_06;

import java.util.Scanner;

public class HomeWork_01 {
    public static void main(String[] args) {
        /**
         Задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
         Потом она конвертирует строки в верхний регистр (Мама превращается в МАМА) и выводит их на экран.

         Новая задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
         Если в строке чётное число букв, строка удваивается, если нечётное - утраивается.
         Программа выводит слова на экран.*/

        Scanner scanner = new Scanner(System.in);
        String a = scanner.nextLine();
    }
}
